Documents/СтоимостьИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СтоимостьИзделия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Замер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изделие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изделия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Двери</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дверь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Двери</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеталей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ХранимыеФайлыВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеФайлыВерсий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранимыйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыДеталей</Name>
			<Comment>Виды деталей в стоимости изделия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛДСПосн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛДСПдоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка2ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммОсн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кромка05ммДоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрубаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВешалоТорцевое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолкаСотовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кронштейн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляПростая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПетляУгловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Направляющие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Крючки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Софиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трансформатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НогаХром</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Туканы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДВП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтеклоДляПолки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯщикВыдвижной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадАГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Джокер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФасадПолукруглый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консоль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штангодержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фланец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиДизайнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугаГравировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажЗаднейСтенки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаПотолочного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажКоробаВертикального</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопДетали</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СтоимостьИзделия/Ext/ManagerModule.bsl
Функция ПолучитьСуммуДокумента (Ссылка, ДатаДоговора) Экспорт
	
	Если (ДатаДоговора - Ссылка.Дата)/86400 < 30 Тогда
		Возврат Ссылка.СуммаДокумента;
	КонецЕсли;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,
	ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭскизнаяЗаявка") Тогда
		ПодготовитьПечатнуюФорму("ЭскизнаяЗаявка", "Эскизная заявка", "Документ.СтоимостьИзделия.ЭскизнаяЗаявка",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнструкцияПоСборкеШкаф") Тогда
		ПодготовитьПечатнуюФорму("ИнструкцияПоСборкеШкаф", "Инструкция По Сборке Шкаф", "Документ.СтоимостьИзделия.ИнструкцияПоСборкеШкаф",
		МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		Если ИмяМакета = "ЭскизнаяЗаявка" Тогда
			ТабДок = ПечатьЭскизнойЗаявки(МассивОбъектов, ОбъектыПечати); 
		Иначе
			ТабДок = ПечатьИнструкцииПоСборке(МассивОбъектов, ОбъектыПечати);
		КонецЕсли;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета,
		ПредставлениеМакета, ТабДок,, ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЭскизнойЗаявки(МассивОбъектов, ОбъектыПечати)
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("png");
	МассивРасширений.Добавить("bmp");
	МассивРасширений.Добавить("gif");
	МассивРасширений.Добавить("jpeg");
	МассивРасширений.Добавить("jpg");
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ЭскизнаяЗаявка";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Автомасштаб = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьИзделия.Дата КАК Дата,
	|	СтоимостьИзделия.Изделие КАК Изделие,
	|	СтоимостьИзделия.Комментарий КАК Комментарий,
	|	СтоимостьИзделия.Номер КАК Номер,
	|	СтоимостьИзделия.Номенклатура.(
	|		Номенклатура,
	|		Деталь
	|	),
	|	ХранимыеФайлыВерсий.ХранимыйФайл,
	|	СтоимостьИзделия.Двери.(
	|		Дверь.Профиль КАК Профиль
	|	),
	|	СтоимостьИзделия.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СтоимостьИзделия КАК СтоимостьИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|		ПО СтоимостьИзделия.Ссылка = ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ВладелецФайла
	|ГДЕ
	|	СтоимостьИзделия.Ссылка В(&МассивОбъектов)
	|	И (СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.ЛДСПосн)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.ЛДСПдоп)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.Кант)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.Ручка)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.Направляющие)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.Софиты)
	|			ИЛИ СтоимостьИзделия.Номенклатура.Деталь = ЗНАЧЕНИЕ(Перечисление.ВидыДеталей.Корзина))
	|	И ХранимыеФайлыВерсий.ВерсияФайла = ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ТекущаяВерсия
	|	И НЕ ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ПометкаУдаления
	|	И ХранимыеФайлыВерсий.ВерсияФайла.Владелец.ТекущаяВерсияРасширение В(&МассивРасширений)
	|ИТОГИ ПО
	|	Ссылка";
	
	Если ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.Договор") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтоимостьИзделия.Ссылка КАК", "СтоимостьИзделия.Договор.Ссылка КАК");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтоимостьИзделия.Ссылка В", "СтоимостьИзделия.Договор.Ссылка В");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Параметры.Вставить("МассивРасширений", МассивРасширений);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = Документы.СтоимостьИзделия.ПолучитьМакет("ЭскизнаяЗаявка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ОбластьКартинка = Макет.ПолучитьОбласть("Картинка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Согласование = Макет.ПолучитьОбласть("Согласование");
	ОбластьРамка = Макет.ПолучитьОбласть("Рамка");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока ВыборкаИтог.Следующий() Цикл
		Выборка = ВыборкаИтог.Выбрать();
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьНоменклатураШапка);
			
			ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаНоменклатура.Номенклатура) Тогда
					ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
					ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаДвери = Выборка.Двери.Выбрать();
			ВыборкаДвери.Следующий();
			Если ЗначениеЗаполнено(ВыборкаДвери.Профиль) Тогда
				ОбластьРамка.Параметры.Заполнить(ВыборкаДвери);
				ТабДок.Вывести(ОбластьРамка, ВыборкаДвери.Уровень());
			КонецЕсли;
			ВыборкаДвери.Сбросить();
			
			Подвал.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Подвал);
			
			ТабДок.Вывести(Согласование);
			
			ДанныеФайла = Выборка.ХранимыйФайл.Получить();
			Р = ТабДок.Области.НоменклатураШапка.Верх;
			С =	ТабДок.Области.Согласование.Низ;
			МояКартинка = Новый Картинка(ДанныеФайла);
			Рис = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Индекс = ТабДок.Рисунки.Индекс(Рис);
			ТабДок.Рисунки[Индекс].Картинка = МояКартинка;
			//Картинка растянута от шапки номенклатуры до согласования
			ТабДок.Рисунки[Индекс].Расположить(ТабДок.Область("R"+Р+"C5:R"+С+"C17"));
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаИтог.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьИнструкцииПоСборке(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ИнструкцияПоСборкеШкаф";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьИзделия.Изделие,
	|	СтоимостьИзделия.Изделие.ИмяМакетаПаспорта КАК ИмяМакета,
	|	СтоимостьИзделия.Ссылка
	|ИЗ
	|	Документ.СтоимостьИзделия КАК СтоимостьИзделия
	|ГДЕ
	|	СтоимостьИзделия.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ИмяМакета) Тогда		
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;		
			
			НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
			
			Макет = Документы.СтоимостьИзделия.ПолучитьМакет(Выборка.ИмяМакета);
			ОбластьТело = Макет.ПолучитьОбласть("Тело");
			ТабДок.Вывести(ОбластьТело);
			
			ВставлятьРазделительСтраниц = Истина;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 
			НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
